package FileParser;

import java.io.BufferedReader;
import java.io.FileInputStream;
import java.io.IOException;
import java.io.InputStreamReader;
import java.util.ArrayList;
import java.util.LinkedList;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/*

신흥버스 ,모다아울렛건너 ,세원정공앞 ,계명대학교동문건너2 ,계명문화대학건너 ,신당동주민센터앞 ,성서서한2차타운1 ,대백한라무지개타운건너 ,용산2동주민센터앞 ,2차서한화성타운건너 ,대구의료원라파엘웰빙센터 ,서대구공단네거리4 ,중리롯데캐슬앞 ,진달래아파트앞 ,서구청건너 ,달서교회앞 ,큰장네거리4 ,섬유회관앞 ,곽병원건너 ,2.28기념중앙공원앞 ,칠성시장건너 ,강남약국앞1 ,평화시장건너 ,동대구역지하도2 ,동구청건너 ,아양교역(2번출구) ,대구국제공항앞 ,불로전통시장앞 ,불로천주교회건너 ,봉무레포츠공원앞 ,봉무청구새들마을앞 ,팔공보성아파트건너 ,미대동2 ,구암동2 ,미곡동1 ,공산초등학교건너 ,서당마을앞 ,방짜유기박물관앞 ,도학동1 ,시교육연수원입구앞 ,동화교1 ,동화사입구앞 ,동화시설집단지구(종점)2 ,:
칠곡경북대병원후문앞 ,학정청아람건너 ,대구산재병원앞 ,동화골든빌(동편) ,칠곡그린빌2차건너 ,칠곡그린빌3차건너 ,칠곡3차화성타운2 ,운암초등학교앞 ,북구구민운동장건너 ,동서변리벤빌앞 ,무태조야동주민센터앞2 ,무태네거리(시내방향) ,산격주공아파트앞 ,경북도청건너 ,홈플러스대구점앞 ,경상감영공원앞 ,약령시앞 ,2호선반월당역2 ,경대사대부설고등학교앞 ,대구은행역(2번출구) ,동성초등학교앞 ,수성구보건소앞 ,정화우방팔레스 ,수성못오거리1 ,파동1차시장건너 ,대자연맨션건너 ,화성파크뷰앞 ,가창면사무소건너 ,허브힐즈입구 ,스파밸리1 ,냉천리2 ,가창중학교앞 ,가창초등학교건너 ,:
동명교통 ,동명면사무소건너 ,봉암동(칠곡군)2 ,칠곡중학교앞 ,칠곡동화아파트앞 ,대구은행칠곡지점앞 ,대구과학대학2 ,태전삼거리2 ,대구병원건너 ,대백인터빌건너 ,팔달시장건너 ,원대금류타운앞 ,섬유회관앞 ,곽병원건너 ,2.28기념중앙공원앞 ,중구청건너 ,대구중앙고등학교앞 ,법원건너 ,그랜드호텔앞 ,어린이회관건너1 ,황금네거리2 ,동아스포츠센터(지산중학교앞) ,지산청구타운건너 ,동아백화점수성점건너 ,범물청구맨션건너 ,범물1동주민센터앞 ,:
대곡역(1번출구) ,화원초등학교건너 ,화원고등학교건너 ,옥포초등학교건너 ,논공읍사무소 ,상리공단건너 ,북리1 ,논공가톨릭병원건너 ,달성우체국건너 ,유가차천1 ,구지청아람앞 ,근린공원축구장건너 ,:
성보교통 ,검단동대구축협앞 ,검단동주민센터건너 ,성광고등학교건너 ,검단유성아파트앞 ,검단유성아파트(서편) ,중소기업관앞 ,한국패션센터 ,북대구초등학교건너 ,전기재료관1 ,전자상가 ,상수도사업본부시설관리소건너 ,연암네거리3 ,산격주공아파트앞 ,산격문화회관건너 ,성북시장앞 ,성북교1 ,경북도청건너 ,산격청구맨션건너 ,경대교2 ,대일아파트앞 ,동대구시장앞 ,신암육교2 ,파티마병원건너1 ,동대구역건너 ,동대구고속버스터미널앞 ,경북아파트앞(신천동) ,동부정류장앞 ,동부시외버스터미널(순환2번) ,코오롱아파트 ,우방만촌하이츠건너 ,대구문화방송건너 ,법원건너 ,그랜드호텔앞 ,여성메디파크 ,범어쌍용예가앞 ,수성롯데캐슬앞 ,수성시장네거리2 ,한가람타운건너 ,대백프라자앞 ,대봉성당 ,상수도사업본부건너 ,명덕네거리2 ,명덕초등학교앞 ,프린스호텔건너 ,계명대학교대명캠퍼스건너 ,대명시장건너 ,서대구시장건너 ,새길시장앞 ,구)대영학원건너 ,한전서대구지사건너 ,서부시장앞 ,대구은행북비산지점건너1 ,비산지하도1 ,원대시장앞 ,북침산치안센터건너 ,침산초등학교건너 ,북구보건소건너 ,침산변전소건너 ,성북시장건너 ,산격문화회관앞 ,산격주공아파트건너 ,연암네거리1 ,산업용재관 ,전기재료관2 ,북대구초등학교앞 ,검단119안전센터 ,중소기업관건너 ,검단유성아파트건너 ,성광고등학교앞 ,검단동주민센터앞 ,(주)성안건너 ,성보교통 ,:
성보교통 ,검단동대구축협앞 ,검단동주민센터건너 ,성광고등학교건너 ,검단유성아파트앞 ,검단유성아파트(서편) ,중소기업관앞 ,한국패션센터 ,북대구초등학교건너 ,전기재료관1 ,전자상가 ,상수도사업본부시설관리소건너 ,연암네거리3 ,산격주공아파트앞 ,산격문화회관건너 ,성북시장앞 ,침산변전소앞 ,북구보건소앞 ,침산초등학교앞 ,북침산치안센터앞 ,원대시장건너1 ,비산지하도2 ,대구은행북비산지점앞 ,서부시장건너 ,한전서대구지사앞 ,구)대영학원앞 ,새길시장건너 ,서대구시장앞 ,대명시장앞 ,계명대학교대명캠퍼스앞 ,프린스호텔앞 ,명덕초등학교건너 ,명덕네거리1 ,상수도사업본부 ,대봉교회 ,대백프라자건너 ,한가람타운앞 ,수성시장네거리1 ,수성롯데캐슬건너 ,범어쌍용예가건너 ,그랜드호텔건너 ,법원앞 ,대구문화방송앞 ,우방만촌하이츠앞 ,동부정류장(메트로팔레스) ,동부정류장건너 ,경북아파트건너(신천동) ,동대구고속버스터미널건너 ,동대구역 ,동대구맨션 ,평화시장앞 ,신암육교1 ,동대구시장건너 ,대일아파트건너 ,북구선거관리위원회앞 ,산격청구맨션앞 ,경북도청앞 ,성북교2 ,성북시장건너 ,산격문화회관앞 ,산격주공아파트건너 ,연암네거리1 ,산업용재관 ,전기재료관2 ,북대구초등학교앞 ,검단119안전센터 ,중소기업관건너 ,검단유성아파트건너 ,성광고등학교앞 ,검단동주민센터앞 ,(주)성안건너 ,성보교통 ,:
범물1동주민센터건너 ,범물청구맨션앞 ,동아백화점수성점앞 ,지산3단지건너 ,범물1단지앞 ,수성소방서1 ,우방신천지타운앞 ,황금우방1차건너 ,성동초등학교앞 ,캐슬골드파크(1102동) ,헬로TV대구방송앞 ,SK리더스뷰건너 ,들안길초등학교건너 ,중동네거리2 ,중동시장앞 ,중동교2 ,앞산힐스테이트건너 ,팔레스호텔건너 ,신신정비공장2 ,영대병원역(3번출구) ,남부경찰서앞 ,현충로역(4번출구) ,대구차여성병원앞 ,남대구등기소앞 ,대구가톨릭대학병원건너 ,두류공원네거리1 ,이월드(구.우방랜드)정문 ,국민건강보험공단앞 ,내당삼익맨션건너 ,평리청구타운건너 ,신평리네거리1 ,한국폴리텍VI대구대학건너 ,서구시장앞 ,평리네거리1 ,북부정류장건너 ,비산7동우체국앞1 ,팔달신시장2 ,노원119안전센터앞 ,대구은행3공단지점앞 ,국민은행3공단지점건너 ,노원네거리2 ,침산남영타운앞 ,경상여자고등학교앞 ,연암네거리1 ,상수도사업본부시설관리소앞 ,산격중학교건너 ,산격종합시장앞 ,신세계병원앞 ,복현오거리1 ,영진전문대학후문건너 ,영진고등학교건너 ,복현광명아파트건너 ,신성초등학교건너 ,큰고개오거리2 ,전기안전공사앞 ,태왕메트로시티앞 ,효목네거리1 ,만촌1동주민센터앞 ,무열대건너 ,만촌태왕리더스앞1 ,만촌육교1 ,우방청솔맨션건너 ,동도중학교건너 ,국립대구박물관앞 ,경북고등학교건너 ,우방신천지타운건너 ,수성소방서2 ,범물1단지건너 ,지산3단지앞 ,동아백화점수성점건너 ,범물청구맨션건너 ,범물1동주민센터앞 ,:
범물1동주민센터건너 ,범물청구맨션앞 ,동아백화점수성점앞 ,지산3단지건너 ,범물1단지앞 ,수성소방서1 ,우방신천지타운앞 ,경북고등학교앞 ,국립대구박물관건너 ,동도중학교앞 ,우방청솔맨션앞 ,만촌육교2 ,만촌2동주민센터앞 ,만촌태왕리더스건너 ,무열대앞 ,만촌1동주민센터건너 ,효목네거리2 ,태왕메트로시티건너 ,전기안전공사건너 ,큰고개오거리1 ,신성초등학교앞 ,복현광명아파트앞 ,영진고등학교앞 ,영진전문대학후문앞 ,신세계병원건너 ,산격대우아파트앞 ,산격중학교앞 ,상수도사업본부시설관리소건너 ,연암네거리2 ,경상여자고등학교건너 ,침산남영타운건너 ,노원네거리1 ,국민은행3공단지점앞 ,3공단새마을금고앞 ,노원119안전센터건너 ,서대구초등학교입구 ,북부정류장 ,평리네거리2 ,서구시장건너 ,한국폴리텍VI대구대학앞 ,신평리네거리2 ,평리청구타운앞 ,내당삼익맨션앞 ,국민건강보험공단건너 ,두류도서관앞 ,두류공원네거리2 ,대구가톨릭대학병원앞 ,남대구등기소건너 ,대구차여성병원건너 ,현충로역(3번출구) ,영대병원역 ,신신정비공장1 ,남구청건너 ,팔레스호텔앞2 ,앞산힐스테이트앞 ,중동교1 ,중동시장건너 ,중동네거리1 ,들안길초등학교앞 ,SK리더스뷰앞 ,헬로TV대구방송건너 ,캐슬골드파크(1504동) ,성동초등학교건너 ,황금우방1차앞 ,우방신천지타운건너 ,수성소방서2 ,범물1단지건너 ,지산3단지앞 ,동아백화점수성점건너 ,범물청구맨션건너 ,범물1동주민센터앞 ,:
파계사(종점) ,한걸고정마을 ,중대1동회관앞 ,중리마을 ,중리삼거리2 ,덕곡삼거리2 ,매골2 ,화전동2 ,동북주유소건너 ,명산교(명산화성타운건너) ,지묘초등학교건너 ,지묘동2 ,태왕그린힐즈앞2 ,파군재삼거리1 ,봉무청구새들마을건너 ,위남마을입구 ,이시아폴리스더샵1단지 ,봉무레포츠공원건너 ,불로천주교회앞 ,불로전통시장건너 ,불로화훼단지건너 ,불로삼거리 ,대구국제공항건너 ,공항시장건너 ,지저동주민센터건너 ,아양교3 ,아양교역(1번출구) ,동구청앞 ,큰고개역(4번출구) ,산림조합중앙회건너 ,동대구역지하도1 ,동대구역수화물취급소건너 ,동대구초등학교앞 ,신암건영캐스빌건너 ,신천역(2번출구) ,신천주공아파트앞 ,칠성시장앞 ,태평상가앞1 ,대구역앞 ,시민회관앞 ,도원아파트건너 ,고성아파트(서편) ,원대금류타운건너 ,북대구세무서앞 ,침산중학교건너 ,명성푸르지오건너 ,침산변전소건너 ,성북교1 ,경북도청건너 ,실내체육관건너 ,산격초등학교앞 ,대원유치원건너 ,산격종합시장앞 ,신세계병원앞 ,복현오거리2 ,복현대백맨션앞 ,코스트코홀세일건너/복현화성타운앞 ,성화여고건너 ,태왕아너스복현앞 ,복현우방아파트 ,불로우방아파트앞 ,불로화훼단지앞 ,팔공산IC입구 ,불로전통시장앞 ,불로천주교회건너 ,봉무레포츠공원앞 ,이시아폴리스더샵2단지 ,원불교앞 ,봉무청구새들마을앞 ,파군재삼거리2 ,태왕그린힐즈건너 ,지묘동1 ,지묘초등학교앞 ,동북주유소앞 ,화전동1 ,매골1 ,덕곡삼거리1 ,중리삼거리1 ,공산파출소 ,파계사(종점) ,:
파계사(종점) ,한걸고정마을 ,중대1동회관앞 ,중리마을 ,중리삼거리2 ,덕곡삼거리2 ,매골2 ,화전동2 ,동북주유소건너 ,명산교(명산화성타운건너) ,지묘초등학교건너 ,지묘동2 ,태왕그린힐즈앞2 ,파군재삼거리1 ,봉무청구새들마을건너 ,위남마을입구 ,이시아폴리스더샵1단지 ,봉무레포츠공원건너 ,불로천주교회앞 ,불로전통시장건너 ,불로화훼단지건너 ,불로삼거리 ,대구국제공항건너 ,공항시장건너 ,지저동주민센터건너 ,아양교3 ,아양교역(1번출구) ,동구청앞 ,큰고개역(4번출구) ,산림조합중앙회건너 ,동대구역지하도1 ,동대구역수화물취급소건너 ,동대구초등학교앞 ,신암건영캐스빌건너 ,신천역(2번출구) ,신천주공아파트앞 ,칠성시장앞 ,태평상가앞1 ,대구역앞 ,시민회관앞 ,도원아파트건너 ,고성아파트(서편) ,원대금류타운건너 ,북대구세무서앞 ,침산중학교건너 ,명성푸르지오건너 ,침산변전소건너 ,성북교1 ,경북도청건너 ,실내체육관건너 ,산격초등학교앞 ,대원유치원건너 ,산격종합시장앞 ,신세계병원앞 ,복현오거리2 ,복현대백맨션앞 ,코스트코홀세일건너/복현화성타운앞 ,성화여고건너 ,태왕아너스복현앞 ,복현우방아파트 ,불로우방아파트앞 ,불로화훼단지앞 ,팔공산IC입구 ,불로전통시장앞 ,불로천주교회건너 ,봉무레포츠공원앞 ,이시아폴리스더샵2단지 ,원불교앞 ,봉무청구새들마을앞 ,파군재삼거리2 ,태왕그린힐즈건너 ,지묘동1 ,지묘초등학교앞 ,동북주유소앞 ,화전동1 ,매골1 ,덕곡삼거리1 ,중리삼거리1 ,공산파출소 ,송정동3 ,송정동1 ,당정마을입구 ,팔공한마음주유소 ,덕곡(대구선명학교) ,덕곡(달구벌고교) ,팔공한마음주유소건너 ,당정마을입구건너 ,송정동2 ,송정동4 ,파계사(종점) ,:
 */
public class FileParser {

	private ArrayList<String> result = new ArrayList<String>();
	private int searchIndex;

	public FileParser(ArrayList<String> sourceList) {
			
			for (int i = 0; i < sourceList.size(); i++) {
				String mo = sourceList.get(i).replaceAll("\\(\\d+\\)","");
				mo = mo.replaceAll(" ,", ";");
				result.add(mo);
			}
		
	}

	public ArrayList<String> getResult() {
		return result;
	}
}
